---
kind: property
id: P:Autodesk.Revit.DB.InsulationLiningBase.Thickness
zh: 厚度
source: html/c3461678-f53e-f347-8d47-0b7a9c7e5671.htm
---
# Autodesk.Revit.DB.InsulationLiningBase.Thickness Property

**中文**: 厚度

Thickness of the insulation or lining element.

## Syntax (C#)
```csharp
public double Thickness { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: Thickness is not valid for assignment to insulation or lining elements.